tutorials/contactAngleTesting/DEP_noSolids_copy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    walls
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    geometry
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    inlet
    {
       type            fixedValue;
       value           uniform (0 0.1 0);
    }
    outlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
